import Layout from "../components/Layout";

// Next.js で用意されている img コンポーネントを import する。
// 画像の最適化機能付き。
// クライアントの環境に応じて適切な形式（WebPなど）に変換。
// ファイルサイズ縮小.
// width heightを指定しても縦横比を維持したまま自動でレスポンシブ対応。
import Image from "next/image";

const Contact = () => {
  return (
    <Layout title="Contact">
      Contact page
      {/* Contact info のカードをスタイリング */}
      <div className="bg-white text-center shadow-xl p-8 w-80 rounded">
        {/* カード内のタイトル */}
        <div className="mt-4">
          <p className="font-bold">About Ken</p>
        </div>

        {/* アバターイメージ */}
        <div className="flex justify-center mt-4">
          {/* Next.js の Img コンポーネントを使用 */}
          <Image
            // border radius 9999px
            className="rounded-full"
            // src は public フォルダの root ( / ) でアクセスできる。
            // 拡張子は jpeg ではなく jpg !
            src="/avatar.jpg"
            width={60}
            height={60}
            alt="Avatar"
          />
        </div>

        {/* default 値 */}
        {/* <div className="mt-4"> */}
        <div className="mt-6 flex justify-around">
          <div>
            {/* default */}
            {/* <p className="font-bold">Address</p> */}
            <p className="font-bold mt-3">Address</p>
            <p className="text-xs mt-2 text-gray-600">Hyogo Japan</p>
          </div>
          <div>
            <p className="font-bold mt-3">E-mail</p>
            <p className="text-xs mt-2 text-gray-600">abc@gmail.com</p>
            {/* <p className="font-bold mt-3">Phone</p>
          <p className="text-xs mt-2 text-gray-600">000-123-456</p> */}
          </div>
        </div>
      </div>
      {/* 各アイテムを均等に配置し、各アイテムの両側に半分の大きさの間隔を置く */}
      <div className="mt-6 flex justify-around">
        {/* Zenn */}
        <div>
          <a
            href="https://zenn.dev/ken505"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              className="w-6 h-6 mr-3 text-blue-400"
              fill="currentColor"
              // role ってなんだろ？
              // role="img"
              viewBox="0 0 24 24"
              xmlns="http://www.w3.org/2000/svg"
            >
              {/* hover したら title が出るけど・・いる？？ */}
              {/* <title>Zenn icon</title> */}
              <path d="M.264 23.771h4.984c.264 0 .498-.147.645-.352L19.614.874c.176-.293-.029-.645-.381-.645h-4.72c-.235 0-.44.117-.557.323L.03 23.361c-.088.176.029.41.234.41zM17.445 23.419l6.479-10.408c.205-.323-.029-.733-.41-.733h-4.691c-.176 0-.352.088-.44.235l-6.655 10.643c-.176.264.029.616.352.616h4.779c.234-.001.468-.118.586-.353z" />
            </svg>
          </a>
        </div>

        {/* twitter の svg 画像とリンク */}
        <div>
          {/* svg 画像を a タグで囲い、別タグでリンクへ飛ばす処理。 */}
          <a
            href="https://twitter.com/ken_main_js"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              className="w-6 h-6 mr-3 text-blue-500"
              stroke="currentColor"
              fill="currentColor"
              viewBox="0 0 512 512"
              // xmlns属性は、名前空間を宣言するための属性です。
              // 属性値にURIを指定することで、名前空間を宣言することができます。
              // XHTMLではデフォルト名前空間として属性値に必ず「http://www.w3.org/1999/xhtml」を指定しなければならないとされています。
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M459.37 151.716c.325 4.548.325 9.097.325 13.645 0 138.72-105.583 298.558-298.558 298.558-59.452 0-114.68-17.219-161.137-47.106 8.447.974 16.568 1.299 25.34 1.299 49.055 0 94.213-16.568 130.274-44.832-46.132-.975-84.792-31.188-98.112-72.772 6.498.974 12.995 1.624 19.818 1.624 9.421 0 18.843-1.3 27.614-3.573-48.081-9.747-84.143-51.98-84.143-102.985v-1.299c13.969 7.797 30.214 12.67 47.431 13.319-28.264-18.843-46.781-51.005-46.781-87.391 0-19.492 5.197-37.36 14.294-52.954 51.655 63.675 129.3 105.258 216.365 109.807-1.624-7.797-2.599-15.918-2.599-24.04 0-57.828 46.782-104.934 104.934-104.934 30.213 0 57.502 12.67 76.67 33.137 23.715-4.548 46.456-13.32 66.599-25.34-7.798 24.366-24.366 44.833-46.132 57.827 21.117-2.273 41.584-8.122 60.426-16.243-14.292 20.791-32.161 39.308-52.628 54.253z"></path>
            </svg>
          </a>
        </div>

        {/* Facebook */}
        <div>
          <a
            href="https://nerdcave.com/tailwind-cheat-sheet"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              className="w-6 h-6 mr-3 text-blue-700"
              fill="currentColor"
              viewBox="0 0 24 24"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M22.675 0h-21.35c-.732 0-1.325.593-1.325 1.325v21.351c0 .731.593 1.324 1.325 1.324h11.495v-9.294h-3.128v-3.622h3.128v-2.671c0-3.1 1.893-4.788 4.659-4.788 1.325 0 2.463.099 2.795.143v3.24l-1.918.001c-1.504 0-1.795.715-1.795 1.763v2.313h3.587l-.467 3.622h-3.12v9.293h6.116c.73 0 1.323-.593 1.323-1.325v-21.35c0-.732-.593-1.325-1.325-1.325z" />
            </svg>
          </a>
        </div>

        {/* Github */}
        <div>
          <a
            href="https://github.com/ken505"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              className="w-6 h-6 mr-3 text-gray-500"
              fill="currentColor"
              viewBox="0 0 512 512"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"></path>
            </svg>
          </a>
        </div>

        {/* Instagram */}
        <div>
          <a
            href="https://www.instagram.com/ken_main.tsx/"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              className="w-6 h-6 mr-3 text-pink-600"
              fill="currentColor"
              viewBox="0 0 551.034 551.034"
              // style="enable-background:new 0 0 551.034 551.034;"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                class="logo"
                id="XMLID_17_"
                d="M386.878,0H164.156C73.64,0,0,73.64,0,164.156v222.722 c0,90.516,73.64,164.156,164.156,164.156h222.722c90.516,0,164.156-73.64,164.156-164.156V164.156 C551.033,73.64,477.393,0,386.878,0z M495.6,386.878c0,60.045-48.677,108.722-108.722,108.722H164.156 c-60.045,0-108.722-48.677-108.722-108.722V164.156c0-60.046,48.677-108.722,108.722-108.722h222.722 c60.045,0,108.722,48.676,108.722,108.722L495.6,386.878L495.6,386.878z"
              />

              <path
                id="XMLID_81_"
                // fill="#555"
                d="M275.517,133C196.933,133,133,196.933,133,275.516 s63.933,142.517,142.517,142.517S418.034,354.1,418.034,275.516S354.101,133,275.517,133z M275.517,362.6 c-48.095,0-87.083-38.988-87.083-87.083s38.989-87.083,87.083-87.083c48.095,0,87.083,38.988,87.083,87.083 C362.6,323.611,323.611,362.6,275.517,362.6z"
              />

              <circle
                id="XMLID_83_"
                // fill="#555"
                cx="418.306"
                cy="134.072"
                r="34.149"
              />
            </svg>
          </a>
        </div>
      </div>
    </Layout>
  );
};

export default Contact;
